---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ResetToposurfacePhaseCreated
source: html/3a6aa337-4f25-30d9-e35f-7ed6c96e17d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ResetToposurfacePhaseCreated Property

The parameter Phase Created of the Toposurface is not set to the first Phase. No pre-existing toposurface were detected. The parameter will be reset to the first Phase unless Keep Phase Created option is picked.

## Syntax (C#)
```csharp
public static FailureDefinitionId ResetToposurfacePhaseCreated { get; }
```